# BottomSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Blend..::..BottomSketch Property
Blend Class See Also
---
Returns the Bottom Sketch of the Blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Sketch BottomSketch { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BottomSketch As Sketch
	Get
```

Visual C++
---
```text
public:
property Sketch^ BottomSketch {
	Sketch^ get ();
}
```

# Remarks
This property is used to retrieve the Bottom Sketch of the Blend.
# See Also
Blend Class
Autodesk.Revit.DB Namespace